package ru.netology.tests;

public class CardDeliveryOrderTest {

    //end to end
    //отправка пустой формы
    //поле ГОРОД не заполнено
    //поле ДАТА ВСТРЕЧИ не заполнено
    //поле ФИО не заполнено
    //поле ТЕЛЕФОН не заполнено
    //чекбокс не активен
    //поле ГОРОД заполнено не субъектом РФ
    //поле ДАТА заполнено ранее трёх дней с текущей даты
    //поле ФИО заполнено на иностранном языке
    //поле ФИО заполнено символами
    //поле ФИО заполнено цифрами
    //поле ФИО заполнено со специфичными буквами (например ё)
    //поле ФИО заполнено пробелами
    //в поле ТЕЛЕФОН меньше 11 цифр
    //в поле ТЕЛЕФОН больше 11 цифр
    //в поле ТЕЛЕФОН нет символа +
    //в поле ТЕЛЕФОН символ + в конце

}
